#### Object and Classes

In [1]:
x = [56, 3, 23, 46, 76, 13]

In [2]:
sorted(x)

[3, 13, 23, 46, 56, 76]

In [3]:
x.sort()
x

[3, 13, 23, 46, 56, 76]

In [15]:
class Person:
    def __init__(self,n='Pune',a=30):
        self.name = n
        self.age = a
    def show(self):
        print('Values are:')
        print(self.name, self.age)

In [18]:
obj1 = Person('Anil')
obj1.show()

Values are:
Anil 30

In [21]:
obj2 = Person(a=27)
obj2.show()

Values are:
Pune 27

In [7]:
obj1.name

'Anil'

In [8]:
obj1.show()

Values are:
Anil 23

In [9]:
obj2 = Person('Sunil',31)
obj2.show()

Values are:
Sunil 31

#### Array Processing using numpy

In [24]:
import numpy as np

In [25]:
num = np.array([56,33,15,38,61,49,62])

In [26]:
print(num)

[56 33 15 38 61 49 62]

In [27]:
num

array([56, 33, 15, 38, 61, 49, 62])

In [28]:
type(num)

numpy.ndarray

In [29]:
num.dtype

dtype('int64')

In [31]:
n = 2 ** 64
n

18446744073709551616

In [32]:
n= 416287468756327647356237568235716358293741246
n

416287468756327647356237568235716358293741246

In [33]:
n = 34 ** 1234
n

699815617362686870163997571635872715284083435199329774173709361749998931729558790221557892286797269408707614145452668916937318612955984937209583026047425997105818855944152373513569732924544248879786444015916362058812676498428359467678908630683525674553295952275027572760901662748546606445431228934896353792603496987216071988094579698770983876119901714505254679856106832565463503542843338460680833724450466227522787728637020177943000296909043962898673078361813230437929715784464873812184478643820443238328611510473688015781470093348070309718181156000273477222321310767600371429094774180382810446848640613857481342224897084242521977476101541132959355778464979806284395511830819982101316312171273250729252031049077985722129544252732592735970451225437852788543474358624221597877669190348660175301296589317510961677303572444941202713378629670088372468196171689997265637400969676268476669610306127212166304054764889121779672513084502156029707187125510858213156376620288040309524875133352781916443317923407978298135919241200359570220322502755042901724220588087040912532101981280805712954347121695968693516149060115482162076162875504206308428429155967692913386595597100490733291417221934759620246634793023303875848295306847431256671597656962097621524616771721300236109352198083936107536756860280387408079725351375820540403574299692515799464311948301892536410377000788367748782290680670513761862862704838830521781907014590114330108928103291596831000339881185667164687779406935659580632876843002368881517925521583454726891639264567229024177364359799257794324964822900459691351870684830091644160379735873598846178796258700127482190631247901724054083647600501324513346588667498734580880983048033266372805349028386992199309867735923204930489481458953994299448902702802568513494992918778532458550613517371086045605406516158333197078108347990803243601126354014597287448879100146888409204979951129157697536

In [34]:
print(num)

[56 33 15 38 61 49 62]

In [35]:
num1 = np.array([67, 23, 45, 56.92, 54, 11, 46])

In [36]:
num1

array([67.  , 23.  , 45.  , 56.92, 54.  , 11.  , 46.  ])

In [37]:
num1[0]

67.0

In [38]:
num1.dtype

dtype('float64')

In [39]:
num1 = np.array([67, 23, 45, 'Hello', 11, 46])

In [40]:
num1

array(['67', '23', '45', 'Hello', '11', '46'], dtype='<U21')

In [41]:
num1 = np.array([True, False, True, True, False])

In [42]:
num1

array([ True, False,  True,  True, False])

In [43]:
num1.dtype

dtype('bool')

In [44]:
z = np.zeros(5)
z

array([0., 0., 0., 0., 0.])

In [45]:
o = np.ones(10)
o

array([1., 1., 1., 1., 1., 1., 1., 1., 1., 1.])

In [46]:
np.arange(10)

array([0, 1, 2, 3, 4, 5, 6, 7, 8, 9])

In [47]:
np.arange(4,10)

array([4, 5, 6, 7, 8, 9])

In [48]:
np.arange(2,20,2)

array([ 2,  4,  6,  8, 10, 12, 14, 16, 18])

In [49]:
np.arange(10,0,-1)

array([10,  9,  8,  7,  6,  5,  4,  3,  2,  1])

In [50]:
np.arange(-5,5,0.25)

array([-5.  , -4.75, -4.5 , -4.25, -4.  , -3.75, -3.5 , -3.25, -3.  ,
       -2.75, -2.5 , -2.25, -2.  , -1.75, -1.5 , -1.25, -1.  , -0.75,
       -0.5 , -0.25,  0.  ,  0.25,  0.5 ,  0.75,  1.  ,  1.25,  1.5 ,
        1.75,  2.  ,  2.25,  2.5 ,  2.75,  3.  ,  3.25,  3.5 ,  3.75,
        4.  ,  4.25,  4.5 ,  4.75])

In [55]:
np.linspace(1,10,20)

array([ 1.        ,  1.47368421,  1.94736842,  2.42105263,  2.89473684,
        3.36842105,  3.84210526,  4.31578947,  4.78947368,  5.26315789,
        5.73684211,  6.21052632,  6.68421053,  7.15789474,  7.63157895,
        8.10526316,  8.57894737,  9.05263158,  9.52631579, 10.        ])

In [56]:
num1 = np.array([56,33,15,38,61,49,62])
num2 = [56,33,15,38,61,49,62]

In [58]:
num1 * 2

array([112,  66,  30,  76, 122,  98, 124])

In [59]:
num2 * 2

[56, 33, 15, 38, 61, 49, 62, 56, 33, 15, 38, 61, 49, 62]

In [60]:
num1 / 3

array([18.66666667, 11.        ,  5.        , 12.66666667, 20.33333333,
       16.33333333, 20.66666667])

In [61]:
num1 + 10

array([66, 43, 25, 48, 71, 59, 72])

In [62]:
num1 - 10

array([46, 23,  5, 28, 51, 39, 52])

In [63]:
num1 = np.array([56,33,15,38,61,49,62])
num2 = np.array([64,22,15,32,18,76,38])

In [64]:
num1 + num2

array([120,  55,  30,  70,  79, 125, 100])

In [65]:
num1 - num2

array([ -8,  11,   0,   6,  43, -27,  24])

In [66]:
num1 * num2

array([3584,  726,  225, 1216, 1098, 3724, 2356])

In [67]:
num1 > num2

array([False,  True, False,  True,  True, False,  True])

In [68]:
num1 == num2

array([False, False,  True, False, False, False, False])

In [69]:
True + False

1

In [70]:
True + True

2

In [71]:
sum(num1 == num2)

1

In [72]:
num1

array([56, 33, 15, 38, 61, 49, 62])

In [73]:
num2

array([64, 22, 15, 32, 18, 76, 38])

In [75]:
mat1 = np.array([[4,5,6],[2,9,8]])

In [76]:
mat1

array([[4, 5, 6],
       [2, 9, 8]])

In [77]:
mat1.shape

(2, 3)

In [78]:
mat1 * 2

array([[ 8, 10, 12],
       [ 4, 18, 16]])

In [79]:
mat1.reshape(3,2)

array([[4, 5],
       [6, 2],
       [9, 8]])

In [80]:
mat1.reshape(6,1)

array([[4],
       [5],
       [6],
       [2],
       [9],
       [8]])

In [81]:
mat1.reshape(6)

array([4, 5, 6, 2, 9, 8])

In [82]:
mat1.flatten()

array([4, 5, 6, 2, 9, 8])

In [83]:
num1

array([56, 33, 15, 38, 61, 49, 62])

In [84]:
num = np.array([56, 33, 15, 38, 61, 49, 62, 21])

In [85]:
num

array([56, 33, 15, 38, 61, 49, 62, 21])

In [86]:
num.reshape(4,2)

array([[56, 33],
       [15, 38],
       [61, 49],
       [62, 21]])

In [87]:
num.sum()

335

In [88]:
num.max()

62

In [89]:
num.min()

15

In [90]:
num.mean()

41.875

In [92]:
np.median(num)

43.5

In [93]:
num

array([56, 33, 15, 38, 61, 49, 62, 21])

In [94]:
np.sort(num)

array([15, 21, 33, 38, 49, 56, 61, 62])

In [95]:
(38+49)/2

43.5

In [97]:
num.size

8

In [98]:
list(num)

[56, 33, 15, 38, 61, 49, 62, 21]

In [99]:
tuple(num)

(56, 33, 15, 38, 61, 49, 62, 21)

In [100]:
set(num)

{15, 21, 33, 38, 49, 56, 61, 62}

#### Pandas data structures

In [103]:
import pandas as pd

In [104]:
s = pd.Series([78,51,29,42,54,22,73])

In [105]:
s

0    78
1    51
2    29
3    42
4    54
5    22
6    73
dtype: int64

In [106]:
s1 = pd.Series([78,51,29,42,54, 22.36, 73])
s1

0    78.00
1    51.00
2    29.00
3    42.00
4    54.00
5    22.36
6    73.00
dtype: float64

In [107]:
s = pd.Series([78,51,29,42,54,22,73],
             index=range(100,107))

In [108]:
s

100    78
101    51
102    29
103    42
104    54
105    22
106    73
dtype: int64

In [109]:
s[102]

29

In [110]:
s[102] = 58
s

100    78
101    51
102    58
103    42
104    54
105    22
106    73
dtype: int64

In [111]:
s.shape

(7,)

In [112]:
s.min()

22

In [113]:
s.max()

78

In [114]:
s.sum()

378

In [115]:
s.size

7

In [116]:
# DataFrame

In [117]:
a = pd.Series([1,2,3,4,5])
b = pd.Series(['ajay','radha','prem','rani',
               'vikas'])
c = pd.Series([67.88, 85.34, 75.67,56.66,64.34])

In [119]:
df = pd.DataFrame({
    'roll': a,
    'name': b,
    'marks': c
})

In [120]:
df

   roll   name  marks
0     1   ajay  67.88
1     2  radha  85.34
2     3   prem  75.67
3     4   rani  56.66
4     5  vikas  64.34

In [121]:
type(df)

pandas.core.frame.DataFrame

In [122]:
df.shape

(5, 3)

In [123]:
df.dtypes

roll       int64
name      object
marks    float64
dtype: object

#### Data Analysis

In [125]:
# Link: https://mitu.co.in/dataset
# Download: student.csv, student1.csv 
# student3.tsv, student3.csv, student5.csv

In [126]:
import os
os.getcwd()

'/home/mitu'

In [127]:
# Data import 
df = pd.read_csv('student.csv')

In [128]:
df

   roll     name class  marks  age
0     1     anil    TE  56.77   22
1     2     amit    TE  59.77   21
2     3   aniket    BE  76.88   19
3     4  ajinkya    TE  69.66   20
4     5     asha    TE  63.28   20
5     6   ayesha    BE  49.55   20
6     7     amar    BE  65.34   19
7     8    amita    BE  68.33   23
8     9     amol    TE  56.75   20
9    10    anmol    BE  78.66   21

In [129]:
df1 = pd.read_csv('student1.csv')

In [130]:
df1

    1     anil  TE  56.77  22
0   2     amit  TE  59.77  21
1   3   aniket  BE  76.88  19
2   4  ajinkya  TE  69.66  20
3   5     asha  TE  63.28  20
4   6   ayesha  BE  49.55  20
5   7     amar  BE  65.34  19
6   8    amita  BE  68.33  23
7   9     amol  TE  56.75  20
8  10    anmol  BE  78.66  21

In [131]:
headers = ['A','B','C','D','E']

In [132]:
df1 = pd.read_csv('student1.csv', 
                 names=headers)

In [133]:
df1

    A        B   C      D   E
0   1     anil  TE  56.77  22
1   2     amit  TE  59.77  21
2   3   aniket  BE  76.88  19
3   4  ajinkya  TE  69.66  20
4   5     asha  TE  63.28  20
5   6   ayesha  BE  49.55  20
6   7     amar  BE  65.34  19
7   8    amita  BE  68.33  23
8   9     amol  TE  56.75  20
9  10    anmol  BE  78.66  21

In [134]:
df3 = pd.read_csv('student3.tsv')

In [135]:
df3

  roll\tname\tclass\tmarks\tage
0        1\tanil\tTE\t56.77\t22
1        2\tamit\tTE\t59.77\t21
2      3\taniket\tBE\t76.88\t19
3     4\tajinkya\tTE\t69.66\t20
4        5\tasha\tTE\t63.28\t20
5      6\tayesha\tBE\t49.55\t20
6        7\tamar\tBE\t65.34\t19
7       8\tamita\tBE\t68.33\t23
8        9\tamol\tTE\t56.75\t20
9      10\tanmol\tBE\t78.66\t21

In [136]:
df3 = pd.read_csv('student3.tsv', sep='\t')

In [137]:
df3

   roll     name class  marks  age
0     1     anil    TE  56.77   22
1     2     amit    TE  59.77   21
2     3   aniket    BE  76.88   19
3     4  ajinkya    TE  69.66   20
4     5     asha    TE  63.28   20
5     6   ayesha    BE  49.55   20
6     7     amar    BE  65.34   19
7     8    amita    BE  68.33   23
8     9     amol    TE  56.75   20
9    10    anmol    BE  78.66   21

In [138]:
type(df)

pandas.core.frame.DataFrame

In [139]:
df.shape

(10, 5)

In [141]:
list(df.columns)

['roll', 'name', 'class', 'marks', 'age']

In [142]:
df.size

50

In [143]:
df.dtypes

roll       int64
name      object
class     object
marks    float64
age        int64
dtype: object

In [144]:
df.T

,0,1,2,3,4,5,6,7,8,9
roll,1,2,3,4,5,6,7,8,9,10
name,anil,amit,aniket,ajinkya,asha,ayesha,amar,amita,amol,anmol
class,TE,TE,BE,TE,TE,BE,BE,BE,TE,BE
marks,56.77,59.77,76.88,69.66,63.28,49.55,65.34,68.33,56.75,78.66
age,22,21,19,20,20,20,19,23,20,21

In [145]:
df.head()

   roll     name class  marks  age
0     1     anil    TE  56.77   22
1     2     amit    TE  59.77   21
2     3   aniket    BE  76.88   19
3     4  ajinkya    TE  69.66   20
4     5     asha    TE  63.28   20

In [146]:
df.head(3)

   roll    name class  marks  age
0     1    anil    TE  56.77   22
1     2    amit    TE  59.77   21
2     3  aniket    BE  76.88   19

In [147]:
df.tail()

   roll    name class  marks  age
5     6  ayesha    BE  49.55   20
6     7    amar    BE  65.34   19
7     8   amita    BE  68.33   23
8     9    amol    TE  56.75   20
9    10   anmol    BE  78.66   21

In [148]:
df.tail(3)

   roll   name class  marks  age
7     8  amita    BE  68.33   23
8     9   amol    TE  56.75   20
9    10  anmol    BE  78.66   21

##### Slicing

In [152]:
df.iloc[3:9,1:4]

      name class  marks
3  ajinkya    TE  69.66
4     asha    TE  63.28
5   ayesha    BE  49.55
6     amar    BE  65.34
7    amita    BE  68.33
8     amol    TE  56.75

In [153]:
x = df.iloc[3:9,1:4]
x

      name class  marks
3  ajinkya    TE  69.66
4     asha    TE  63.28
5   ayesha    BE  49.55
6     amar    BE  65.34
7    amita    BE  68.33
8     amol    TE  56.75

In [154]:
df.iloc[:9,1:4]

      name class  marks
0     anil    TE  56.77
1     amit    TE  59.77
2   aniket    BE  76.88
3  ajinkya    TE  69.66
4     asha    TE  63.28
5   ayesha    BE  49.55
6     amar    BE  65.34
7    amita    BE  68.33
8     amol    TE  56.75

In [155]:
df.iloc[:9,:4]

   roll     name class  marks
0     1     anil    TE  56.77
1     2     amit    TE  59.77
2     3   aniket    BE  76.88
3     4  ajinkya    TE  69.66
4     5     asha    TE  63.28
5     6   ayesha    BE  49.55
6     7     amar    BE  65.34
7     8    amita    BE  68.33
8     9     amol    TE  56.75

In [156]:
df.iloc[3:,1:4]

      name class  marks
3  ajinkya    TE  69.66
4     asha    TE  63.28
5   ayesha    BE  49.55
6     amar    BE  65.34
7    amita    BE  68.33
8     amol    TE  56.75
9    anmol    BE  78.66

In [157]:
df.iloc[5:,:]

   roll    name class  marks  age
5     6  ayesha    BE  49.55   20
6     7    amar    BE  65.34   19
7     8   amita    BE  68.33   23
8     9    amol    TE  56.75   20
9    10   anmol    BE  78.66   21

In [158]:
df.iloc[[2,5,6,7],1:]

     name class  marks  age
2  aniket    BE  76.88   19
5  ayesha    BE  49.55   20
6    amar    BE  65.34   19
7   amita    BE  68.33   23

In [159]:
df.iloc[[2,5,6,7],[1,3,4]]

     name  marks  age
2  aniket  76.88   19
5  ayesha  49.55   20
6    amar  65.34   19
7   amita  68.33   23

In [163]:
df.iloc[5,:]

roll          6
name     ayesha
class        BE
marks     49.55
age          20
Name: 5, dtype: object

In [164]:
df.iloc[:,1]

0       anil
1       amit
2     aniket
3    ajinkya
4       asha
5     ayesha
6       amar
7      amita
8       amol
9      anmol
Name: name, dtype: object

In [165]:
df.loc[:,'name']

0       anil
1       amit
2     aniket
3    ajinkya
4       asha
5     ayesha
6       amar
7      amita
8       amol
9      anmol
Name: name, dtype: object

In [166]:
df.loc[:,['name','marks']]

      name  marks
0     anil  56.77
1     amit  59.77
2   aniket  76.88
3  ajinkya  69.66
4     asha  63.28
5   ayesha  49.55
6     amar  65.34
7    amita  68.33
8     amol  56.75
9    anmol  78.66

In [167]:
df['name']

0       anil
1       amit
2     aniket
3    ajinkya
4       asha
5     ayesha
6       amar
7      amita
8       amol
9      anmol
Name: name, dtype: object

In [168]:
df[['name','marks']]

      name  marks
0     anil  56.77
1     amit  59.77
2   aniket  76.88
3  ajinkya  69.66
4     asha  63.28
5   ayesha  49.55
6     amar  65.34
7    amita  68.33
8     amol  56.75
9    anmol  78.66

In [169]:
df.loc[3:8,['name','marks']]

      name  marks
3  ajinkya  69.66
4     asha  63.28
5   ayesha  49.55
6     amar  65.34
7    amita  68.33
8     amol  56.75

In [170]:
df.name

0       anil
1       amit
2     aniket
3    ajinkya
4       asha
5     ayesha
6       amar
7      amita
8       amol
9      anmol
Name: name, dtype: object

In [171]:
df.drop(5)

   roll     name class  marks  age
0     1     anil    TE  56.77   22
1     2     amit    TE  59.77   21
2     3   aniket    BE  76.88   19
3     4  ajinkya    TE  69.66   20
4     5     asha    TE  63.28   20
6     7     amar    BE  65.34   19
7     8    amita    BE  68.33   23
8     9     amol    TE  56.75   20
9    10    anmol    BE  78.66   21

In [172]:
df.drop([5,2,8])

   roll     name class  marks  age
0     1     anil    TE  56.77   22
1     2     amit    TE  59.77   21
3     4  ajinkya    TE  69.66   20
4     5     asha    TE  63.28   20
6     7     amar    BE  65.34   19
7     8    amita    BE  68.33   23
9    10    anmol    BE  78.66   21

In [173]:
df.drop('class', axis = 1)

   roll     name  marks  age
0     1     anil  56.77   22
1     2     amit  59.77   21
2     3   aniket  76.88   19
3     4  ajinkya  69.66   20
4     5     asha  63.28   20
5     6   ayesha  49.55   20
6     7     amar  65.34   19
7     8    amita  68.33   23
8     9     amol  56.75   20
9    10    anmol  78.66   21

In [174]:
df.drop(['class','age'], axis = 1)

   roll     name  marks
0     1     anil  56.77
1     2     amit  59.77
2     3   aniket  76.88
3     4  ajinkya  69.66
4     5     asha  63.28
5     6   ayesha  49.55
6     7     amar  65.34
7     8    amita  68.33
8     9     amol  56.75
9    10    anmol  78.66

In [175]:
df['marks'].sum()

644.9899999999999

In [176]:
df['marks'].mean()

64.499

In [178]:
df['marks'].median()

64.31

In [179]:
df['marks'].max()

78.66

In [180]:
df['marks'].min()

49.55

In [181]:
df['marks'].count()

10

In [182]:
df['marks'].std()

9.207178901994535

In [183]:
df

   roll     name class  marks  age
0     1     anil    TE  56.77   22
1     2     amit    TE  59.77   21
2     3   aniket    BE  76.88   19
3     4  ajinkya    TE  69.66   20
4     5     asha    TE  63.28   20
5     6   ayesha    BE  49.55   20
6     7     amar    BE  65.34   19
7     8    amita    BE  68.33   23
8     9     amol    TE  56.75   20
9    10    anmol    BE  78.66   21

In [184]:
df['class'].mode()

0    BE
1    TE
dtype: object

In [185]:
df['age'].mode()

0    20
dtype: int64

In [186]:
df['class'].value_counts()

BE    5
TE    5
Name: class, dtype: int64

In [187]:
df['age'].value_counts()

20    4
19    2
21    2
22    1
23    1
Name: age, dtype: int64

In [188]:
df['name'].value_counts()

ayesha     1
asha       1
amit       1
anil       1
amar       1
ajinkya    1
amita      1
aniket     1
anmol      1
amol       1
Name: name, dtype: int64

In [189]:
df['age'].values

array([22, 21, 19, 20, 20, 20, 19, 23, 20, 21])

In [190]:
df.values

array([[1, 'anil', 'TE', 56.77, 22],
       [2, 'amit', 'TE', 59.77, 21],
       [3, 'aniket', 'BE', 76.88, 19],
       [4, 'ajinkya', 'TE', 69.66, 20],
       [5, 'asha', 'TE', 63.28, 20],
       [6, 'ayesha', 'BE', 49.55, 20],
       [7, 'amar', 'BE', 65.34, 19],
       [8, 'amita', 'BE', 68.33, 23],
       [9, 'amol', 'TE', 56.75, 20],
       [10, 'anmol', 'BE', 78.66, 21]], dtype=object)

In [191]:
list(df['marks'])

[56.77, 59.77, 76.88, 69.66, 63.28, 49.55, 65.34, 68.33, 56.75, 78.66]

#### Summary

In [193]:
df.describe()

           roll      marks        age
count  10.00000  10.000000  10.000000
mean    5.50000  64.499000  20.500000
std     3.02765   9.207179   1.269296
min     1.00000  49.550000  19.000000
25%     3.25000  57.520000  20.000000
50%     5.50000  64.310000  20.000000
75%     7.75000  69.327500  21.000000
max    10.00000  78.660000  23.000000

In [194]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 10 entries, 0 to 9
Data columns (total 5 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   roll    10 non-null     int64
 1   name    10 non-null     object
 2   class   10 non-null     object
 3   marks   10 non-null     float64
 4   age     10 non-null     int64
dtypes: float64(1), int64(2), object(2)
memory usage: 528.0+ bytes